# InvalidReflectivityPercentage Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RoomFailures..::..InvalidReflectivityPercentage Property
BuiltInFailures..::..RoomFailures Class See Also
---
The value for Reflectivity must be between 0 and 1.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidReflectivityPercentage { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidReflectivityPercentage As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidReflectivityPercentage {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RoomFailures Class
Autodesk.Revit.DB Namespace